Trying to configure the Ping One MFA or Ping One Notifications (in both cases, adding policy IDs) via Terraform creates a new connector with a blank Client Secret

```hcl
resource "davinci_connection" "ping_one_mfa" {
  environment_id = pingone_environment.dev.id
  connector_id   = "pingOneMfaConnector"
  name           = "PingOne MFA"
  property {
    name  = "region"
    value = "AP"          ## this is inconsistent with all other use of region values
  }
  property {
    name  = "envId"
    value = pingone_environment.dev.id
  }
  property {
    name  = "clientId"
    value = tolist(data.davinci_connection.ping_one.property)[index(tolist(data.davinci_connection.ping_one.property).*.name, "clientId")].value
  }
  property {
    name  = "clientSecret"
    value = tolist(data.davinci_connection.ping_one.property)[index(tolist(data.davinci_connection.ping_one.property).*.name, "clientSecret")].value
  }
  property {
    name  = "policyId"
    value = pingone_mfa_policy.mfa_policy.id
  }
}
```

`plan` or `apply` output is as follows
```
  # davinci_connection.ping_one_mfa will be created
  + resource "davinci_connection" "ping_one_mfa" {
      + connector_id   = "pingOneMfaConnector"
      + created_date   = (known after apply)
      + customer_id    = (known after apply)
      + environment_id = "cf4xxxxxxxxxxxxec"
      + id             = (known after apply)
      + name           = "PingOne MFA"
      + property {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + property {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + property {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + property {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + property {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }
```